{
  "users": [
    {
      "email": "contentCreator@gmail.com",
      "password": "$2a$10$dYfRUT8oMVdJ0S5QpQWLHeUpyni8rSa8LwdKy6WyXo8zI/BhxEAaa",
      "name": "Raony ",
      "avatar": "https://ca.slack-edge.com/TQZR39SET-U02V6186UF5-75b8f3ef7364-512",
      "type": "content creator",
      "data": {
        "phone": "(85) 9 9876-2314",
        "adress": {
          "cep": "60543-535",
          "street": "barão de studart",
          "district": "aldeota",
          "city": "fortaleza",
          "state": "CE"
        }
      },
      "id": 1
    },
    {
      "email": "company@gmail.com",
      "password": "$2a$10$dYfRUT8oMVdJ0S5QpQWLHeUpyni8rSa8LwdKy6WyXo8zI/BhxEAaa",
      "name": "kenzie news network",
      "avatar": "https://files.slack.com/files-pri/TQZR39SET-F03PCD61732/logo__4_.png",
      "type": "company",
      "data": {
        "phone": "(11) 9 4321-5678",
        "adress": {
          "cep": "50643-535",
          "street": "rio branco",
          "district": "costinha",
          "city": "jacarepagua",
          "state": "RJ"
        }
      },
      "id": 2
    },
    {
      "email": "reader@gmail.com",
      "password": "$2a$10$dYfRUT8oMVdJ0S5QpQWLHeUpyni8rSa8LwdKy6WyXo8zI/BhxEAaa",
      "name": "Bruno tiberio",
      "avatar": "https://ca.slack-edge.com/TQZR39SET-U02VCTU9T0B-36a257669ad7-512",
      "type": "reader",
      "data": {
        "phone": "(12) 9 4567-1238",
        "adress": {
          "cep": "50643-117",
          "street": "consolação",
          "district": "caucaia",
          "city": "redenção",
          "state": "MG"
        }
      },
      "id": 3
    }
  ],
  "articles": [
    {
      "name": "Editalconcursosbrasil.com.br",
      "category": "tecnologia",
      "authorId": 1,
      "authorImg": "https://s2.glbimg.com/jsaPuF7nO23vRxQkuJ_V3WgouKA=/e.glbimg.com/og/ed/f/original/2014/06/10/461777879.jpg",
      "author": "Raony",
      "title": "Dá para mudar a cor do WhatsApp? Veja se truques realmente funcionam - Edital Concursos Brasil",
      "description": "Entenda se é possível ou permitido mudar a cor do WhatsApp no seu celular e quais são as possibilidades para que isso aconteça. Evite se expor a algum risco desnecessário",
      "url": "https://editalconcursosbrasil.com.br/noticias/2022/07/da-para-mudar-a-cor-do-whatsapp-descubra-se-truques-realmente-funcionam/",
      "urlToImage": "https://editalconcursosbrasil.com.br/wp-content/uploads/2022/04/WhatsApp-3-1.jpg",
      "content": "Você gostaria de poder mudar a cor do WhatsApp de um jeito prático e bem simples? Saiba que isso pode ser feito sem colocar suas informações ou o próprio celular em algum tipo de risco. Vamos entender mais sobre o assunto a partir de agora. Veja também: Alô timidez! Nova função no WhatsApp vai alegrar pessoas discretas. Cuidado com apps para mudar a cor do WhatsApp. Muitas pessoas gostam de deixar o aparelho celular e seus aplicativos com um toque a mais de personalidade. Isso quer dizer, que esses usuários buscam ferramentas para mudar a cor, a fonte e o aspecto dos programas instalados no dispositivo. Para conseguir esses efeitos e mudar a cor do WhatsApp, alguns usuários acabam instalando programas suspeitos em seus dispositivos. No entanto, essa prática pode colocar seus dados em risco e você pode acabar se dando mal.",
      "id": 1,
      "likes": 3,
      "reports": 0
    },
    {
      "name": "Globo",
			"category":"tecnologia",
			"authorId": 1,
      "authorImg": "https://s2.glbimg.com/jsaPuF7nO23vRxQkuJ_V3WgouKA=/e.glbimg.com/og/ed/f/original/2014/06/10/461777879.jpg",
      "author": "Raony",
			"title": "Euro alcança paridade com o dólar pela primeira vez desde 2002 - Globo",
			"description": "Entre os motivos está o risco para a economia da União Europeia de um corte de abastecimento de gás russo.",
			"url": "https://g1.globo.com/economia/noticia/2022/07/12/dolar-alcanca-paridade-com-o-dolar-pela-primeira-vez-desde-2002.ghtml",
			"urlToImage": "https://s2.glbimg.com/QsfPkHnbzKd_Y3l3WvzwNpgZPYw=/1200x/smart/filters:cover():strip_icc()/i.s3.glbimg.com/v1/AUTH_59edd422c0c84a879bd37670ae4f538a/internal_photos/bs/2017/u/1/Df3pAVRzuEn52mmUcuzw/2016-12-27t112517z-509408227-rc1c688bf1b0-rtrmadp-3-egypt-cenbank.jpg",
			"content": "O euro alcançou pela primeira vez a paridade com o dólar nesta terça-feira (12), desde o início da circulação, há duas décadas, da moeda única europeia, segundo dados da Bloomberg. A desvalorização da moeda europeia frente à norte-americana vem sendo acentuada por conta de preocupações de que uma crise de energia levará a Europa a uma recessão. Ao mesmo tempo, a moeda dos EUA segue valorizando pelas expectativas de que o Federal Reserve (BC dos EUA) aumentará as taxas de juros mais rapidamente que o esperado. Os operadores do mercado temem uma grande crise energética na União Europeia devido à interrupção do fluxo de gás russo que chega pelo gasoduto Nord Stream 1, atualmente em manutenção. A tensão alimenta os temores de uma recessão na Europa. Com isso, os investidores privilegiam a moeda norte-americana, que chegou a ser negociada a um dólar por euro nesta terça, na maior cotação diante da divisa europeia desde 2002.",
      "id": 2,
      "likes": 3,
      "reports": 0
		},
    {
      "name": "Somosfanaticos.fans",
      "category":"esporte",
			"authorId": 1,
      "authorImg": "https://s2.glbimg.com/jsaPuF7nO23vRxQkuJ_V3WgouKA=/e.glbimg.com/og/ed/f/original/2014/06/10/461777879.jpg",
			"author": "Raony",
			"title": "URGENTE: Campeonato Brasileiro pode ser paralisado - Somos Fanáticos Brasil",
			"description": "Associação de Árbitros quer fazer uma greve e paralisar o Campeonato Brasileiro",
			"url": "https://somosfanaticos.fans/br/futebolbrasileiro/URGENTE-Campeonato-Brasileiro-pode-ser-paralisado-20220712-0001.html",
			"urlToImage": "https://cms.somosfanaticos.com/__export/1657623761682/sites/fanaticos/img/2022/07/12/trofxu_campeonato_brasileiro_2021.jpg_242310155.jpg",
			"content": "Os times só voltam a campo pelo Campeonato Brasileiro no próximo final de semana. No entanto, pode ser que a rodada 17 não ocorra na data prevista. Isso porque a Associação Nacional dos Árbitros de Futebol (Anaf) quer uma greve da categoria e, por isso, o Brasileirão seria paralisado. De acordo com o presidente da Anaf, Salmo Valentim, a Confederação Brasileira de Futebol cortou o repasse à Associação do dinheiro referente aos patrocínios exibidos nos uniformes da arbitragem. Com isso, alguns benefícios que a Anaf paga aos árbitros tiveram que ser cortados.Recebíamos R$ 30 mil mensais, dos R$ 10 milhões que a CBF recebe dos patrocinadores que expõem suas marcas nas camisas da arbitragem. Esse recurso era utilizado para a manutenção da entidade, que o utiliza em benefício dos árbitros aplicando seguro lesão, para quem se contundir, transporte terrestre, auxílio médico, jurídico… uma série de benefícios que teremos de cortar - explicou Valentim ao Lance.",
      "id": 3,
      "likes": 3,
      "reports": 0
		},
    {
      "name": "Noticiasaominuto.com",
      "category":"saúde",
      "authorId":1,
			"authorImg":"https://ca.slack-edge.com/TQZR39SET-U02V6186UF5-75b8f3ef7364-512",
			"author": "Raony",  
			"title": "Covid-19. Está a ser desenvolvida uma vacina que contém múltiplas doses - Notícias ao Minuto",
			"description": "É uma novidade que está a ser desenvolvida por cientistas americanos.",
			"url": "https://www.noticiasaominuto.com/lifestyle/2034983/covid-19-esta-a-ser-desenvolvida-uma-vacina-que-contem-multiplas-doses",
			"urlToImage": "https://media-manager.noticiasaominuto.com/1280/naom_62cfc9c761ceb.jpg?crop_params=eyJsYW5kc2NhcGUiOnsiY3JvcFdpZHRoIjoyNTEzLCJjcm9wSGVpZ2h0IjoxNDEzLCJjcm9wWCI6MjYsImNyb3BZIjozOX19",
			"publishedAt": "2022-07-14T09:00:06Z",
			"content": "Uma equipa de cientistas do Massachusetts Institute of Technology está a desenvolver uma vacina, contra a Covid-19, que pode substituir a necessidade de tomar várias doses de reforço.\r\n Esta solução seria uma forma de garantir diferentes fases de vacinação graças ao desenvolvimento de micropartículas que libertam pequenas cargas de anticorpos, em diferentes intervalos. A vacina poderá ajudar, segundo os investigadores, a combater diferentes doenças incluindo sarampo e Covid-19.\r\n Como é que funciona? Ao levar esta vacina estas partículas ficam alojadas por baixo da pele até que sejam libertadas e se desfaçam, um processo semelhante ao dos pontos que se dissolvem. Estas partículas são feitas de 'PLGA', um polímero biocompatível que já foi aprovado pelas entidades competentes e é utilizado em dispositivos médicos como implantes e suturas.",
      "id": 4,
      "likes": 3,
      "reports": 0
    },
    {
			"name": "Globo",
      "category":"entretenimento",  
			"authorId":1,
			"authorImg":"https://ca.slack-edge.com/TQZR39SET-U02V6186UF5-75b8f3ef7364-512",
			"author": "Raony",  
			"title": "Burro, ganso e 'toca aqui': veja os emojis que serão liberados em breve - Globo",
			"description": "Pacote inclui novos animais, alimentos e objetos na lista de ícones que poderão ser usados em conversas na internet. Novos emojis serão lançados em setembro por entidade que padroniza os desenhos.",
			"url": "https://g1.globo.com/tecnologia/noticia/2022/07/14/burro-ganso-e-toca-aqui-veja-os-emojis-que-serao-liberados-em-breve.ghtml",
			"urlToImage": "https://s2.glbimg.com/9JKljeI6OyVIA1zZ4H4CFponQls=/1200x/smart/filters:cover():strip_icc()/i.s3.glbimg.com/v1/AUTH_59edd422c0c84a879bd37670ae4f538a/internal_photos/bs/2022/u/T/VLdbmFTFmZXQyRJhsD2A/emoji-unicode-15-0.jpg",
			"publishedAt": "2022-07-14T08:03:44Z",
			"content": "Um pacote com 31 novos emojis deve ser publicado em setembro e, então, começar a ser liberado aos usuários. A lista inclui novos animais, como burro e ganso, além de novos corações, carinha tremendo e mãos para formarem um 'toca aqui'. Para chegarem às redes sociais e aplicativos de mensagens, por exemplo, os novos ícones precisam ser lançados oficialmente. Esse processo é feito pelo Unicode Consortium, que padroniza caracteres de computador, desde letras e números até emojis. O site Emojipedia, focado em atualizações desses ícones, criou suas versões de como eles deverão parecer quando estiverem disponíveis. Os desenhos terão variações conforme a plataforma em que serão exibidos, mas seguirão o padrão definido pelo Unicode Consortium. O pacote faz parte do padrão Unicode, versão 15.0. Veja quais são os novos emojis: Cara tremendo; Coração rosa; Coração azul; Coração cinza; Mão empurrando para a direita; Mão empurrando para a esquerda; Alce; Burro; Asa; Pássaro preto; Ganso; Água-viva; Jacinto (planta); Gengibre; Ervilha; Leque; Pente garfo; Maracas; Flauta; Khanda (símbolo religioso do siquismo); Wireless.",
      "id": 4,
      "likes": 3,
      "reports": 0
		}
  ],
  "comments": [
    {
      "id": 1,
      "ownerId": 3,
      "articleId": 1,
      "content": "Nossa não sabia desses perigos dos aplicativos de trocar a cor do Zap.",
      "userImg": "https://s2.glbimg.com/jsaPuF7nO23vRxQkuJ_V3WgouKA=/e.glbimg.com/og/ed/f/original/2014/06/10/461777879.jpg",
      "username": "Bruno tiberio"
    },
    {
      "id": 2,
      "ownerId": 3,
      "articleId": 2,
      "content": "O dolar esta alto demais, imagina o euro.",
      "userImg": "https://s2.glbimg.com/jsaPuF7nO23vRxQkuJ_V3WgouKA=/e.glbimg.com/og/ed/f/original/2014/06/10/461777879.jpg",
      "username": "Bruno tiberio"
    },
    {
      "id": 3,
      "ownerId": 3,
      "articleId": 3,
      "content": "O lance ja ta ruim faz muito tempo, ainda tem gente que torce pra ele!",
      "userImg": "https://s2.glbimg.com/jsaPuF7nO23vRxQkuJ_V3WgouKA=/e.glbimg.com/og/ed/f/original/2014/06/10/461777879.jpg",
      "username": "Bruno tiberio"
    }
  ],
  "reported": []
}
